ErpTest/src/DataProcessors/уатПечатьЭСМ7заПериод/уатПечатьЭСМ7заПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>уатПечатьЭСМ7заПериод</name>
  <attributes>
    <name>ДатаВыписки</name>
    <comment>Дата выписки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <comment>Дата конца</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <comment>Транспортное средство</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ErpTest/src/AccumulationRegisters/уатВыработкаПоСтоимости/уатВыработкаПоСтоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВыработкаПоСтоимости</name>
  <comment>(уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <comment>Количество</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПараметрВыработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте упр. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма в валюте регламентированного учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <comment>Маршрут</comment>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураУслуги</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПутЛист</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>ТС</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.уатВидыПеревозок</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Catalogs/уатПараметрыВыработки/уатПараметрыВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПараметрыВыработки</name>
  <comment>(уат)</comment>
  <predefined>
    <items>
      <name>ВесГруза</name>
      <description>Вес груза</description>
    </items>
    <items>
      <name>ВремяВНаряде</name>
      <description>Время в наряде</description>
    </items>
    <items>
      <name>ВремяВПростое</name>
      <description>Время в простое</description>
    </items>
    <items>
      <name>ВремяВПростоеСВклДвигателем</name>
      <description>Время в простое с вкл двигателем</description>
    </items>
    <items>
      <name>ВремяВРаботе</name>
      <description>Время в работе</description>
    </items>
    <items>
      <name>ВремяВРаботеПоДаннымGPS</name>
      <description>Время в работе по данным GPS</description>
    </items>
    <items>
      <name>ВремяВРемонте</name>
      <description>Время в ремонте</description>
    </items>
    <items>
      <name>ВремяДневное</name>
      <description>Время дневное</description>
    </items>
    <items>
      <name>ВремяНочное</name>
      <description>Время ночное</description>
    </items>
    <items>
      <name>ВремяПраздничное</name>
      <description>Время праздничное</description>
    </items>
    <items>
      <name>ВремяСпециальнойРаботы</name>
      <description>Время специальной работы</description>
    </items>
    <items>
      <name>КоличествоДней</name>
      <description>Количество дней</description>
    </items>
    <items>
      <name>КоличествоЕздок</name>
      <description>Количество ездок</description>
    </items>
    <items>
      <name>КоличествоОпераций</name>
      <description>Количество операций</description>
    </items>
    <items>
      <name>КоличествоПассажиров</name>
      <description>Количество пассажиров</description>
    </items>
    <items>
      <name>КоличествоРейсов</name>
      <description>Количество рейсов</description>
    </items>
    <items>
      <name>КоличествоТС</name>
      <description>Количество ТС</description>
    </items>
    <items>
      <name>ОбъемКм</name>
      <description>м3 км</description>
    </items>
    <items>
      <name>Объем</name>
      <description>Объем груза</description>
    </items>
    <items>
      <name>ПогрузочноРазгрузочныеРаботы</name>
      <description>Погрузочно разгрузочные работы</description>
    </items>
    <items>
      <name>Подача</name>
      <description>Подача</description>
    </items>
    <items>
      <name>ПробегНаБуксире</name>
      <description>Пробег на буксире</description>
    </items>
    <items>
      <name>ПробегОбщий</name>
      <description>Пробег общий</description>
    </items>
    <items>
      <name>ПробегОбщийПоДаннымGPS</name>
      <description>Пробег общий по данным GPS</description>
    </items>
    <items>
      <name>ПробегПорожний</name>
      <description>Пробег порожний</description>
    </items>
    <items>
      <name>ПробегСГрузом</name>
      <description>Пробег с грузом</description>
    </items>
    <items>
      <name>ПробегСПассажирами</name>
      <description>Пробег с пассажирами</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы</name>
      <description>Пробег специальной работы</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы2</name>
      <description>Пробег специальной работы 2</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы3</name>
      <description>Пробег специальной работы 3</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы4</name>
      <description>Пробег специальной работы 4</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы5</name>
      <description>Пробег специальной работы 5</description>
    </items>
    <items>
      <name>ПростойПодПогрузкой</name>
      <description>Простой под погрузкой</description>
    </items>
    <items>
      <name>ПростойПодРазгрузкой</name>
      <description>Простой под разгрузкой</description>
    </items>
    <items>
      <name>ТнКм</name>
      <description>Тн км</description>
    </items>
  </predefined>
  <attributes>
    <name>АлгоритмРасчетаПараметра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаТС</name>
    <comment>Действует на ТС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСотрудников</name>
    <comment>Действует на сотрудников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВТарифахНаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Временный</name>
    <comment>Признак того, что параметр временной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПараметровВыработки</name>
    <type>
      <types>EnumRef.уатСпособРасчетаПараметровВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНаработки</name>
    <type>
      <types>CatalogRef.ПоказателиНаработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПоНомеруЭтапа</name>
    <comment>0 - суммировать значения, 1 - выбирать максимальное значение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/DataProcessors/уатПечатьЭСМ7заПериод/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если Объект.РежимОтбора = 0 Тогда
		Элементы.ТС.Доступность = Истина;
		Элементы.ОбъектСтроительства.Доступность = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОбъектыСтроительства;
	Иначе
		Элементы.ТС.Доступность = Ложь;
		Элементы.ОбъектСтроительства.Доступность = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаТС;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыСтроительства()
	СписокОбъектыСтроительства.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ТС) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатВыработкаПоСтоимостиОбороты.ОбъектСтроительства
		|ИЗ
		|	РегистрНакопления.уатВыработкаПоСтоимости.Обороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			,
		|			ТС = &ТС
		|				И Организация = &Организация
		|				И ОбъектСтроительства <> ЗНАЧЕНИЕ(Справочник.СМ_ОбъектыСтроительства.ПустаяСсылка)
		|				И (&КонтрагентНеЗаполнен
		|					ИЛИ Контрагент = &Контрагент)
		|				И (ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
		|					ИЛИ ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяСпециальнойРаботы))) КАК уатВыработкаПоСтоимостиОбороты";
		
		Запрос.УстановитьПараметр("ДатаНач", Объект.ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", Объект.ДатаКон);
		Запрос.УстановитьПараметр("ТС", Объект.ТС);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("КонтрагентНеЗаполнен",  ?(ЗначениеЗаполнено(Объект.Контрагент), Ложь, Истина));
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокОбъектыСтроительства.Добавить(Выборка.ОбъектСтроительства);
		КонецЦикла;
	КонецЕсли;			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписТС()
	СписокТС.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатВыработкаПоСтоимостиОбороты.ТС
		|ИЗ
		|	РегистрНакопления.уатВыработкаПоСтоимости.Обороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			,
		|				Организация = &Организация
		|				И ТС <> ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)
		|				И ОбъектСтроительства = &ОбъектСтроительства
		|				И (&КонтрагентНеЗаполнен
		|					ИЛИ Контрагент = &Контрагент)
		|				И (ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
		|					ИЛИ ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяСпециальнойРаботы))) КАК уатВыработкаПоСтоимостиОбороты";
		
		Запрос.УстановитьПараметр("ДатаНач", Объект.ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", Объект.ДатаКон);
		Запрос.УстановитьПараметр("ОбъектСтроительства", Объект.ОбъектСтроительства);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("КонтрагентНеЗаполнен",  ?(ЗначениеЗаполнено(Объект.Контрагент), Ложь, Истина));
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокТС.Добавить(Выборка.ТС);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьЭСМЗаПериод(мМассивОбъектовСтроительства, мМассивТС)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатВыработкаПоСтоимостиОбороты.Организация КАК Организация,
	|	уатВыработкаПоСтоимостиОбороты.Контрагент КАК Контрагент,
	|	уатВыработкаПоСтоимостиОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
	|	уатВыработкаПоСтоимостиОбороты.Регистратор КАК Регистратор,
	|	уатВыработкаПоСтоимостиОбороты.ПутЛист,
	|	уатВыработкаПоСтоимостиОбороты.ТС КАК ТС,
	|	уатВыработкаПоСтоимостиОбороты.НоменклатураУслуги КАК НоменклатураУслуги,
	|	уатВыработкаПоСтоимостиОбороты.КоличествоОборот КАК КоличествоОборот,
	|	уатВыработкаПоСтоимостиОбороты.СуммаОборот КАК СуммаОборот,
	|	уатВыработкаПоСтоимостиОбороты.СуммаНДСОборот КАК СуммаНДСОборот,
	|	уатВыработкаПоСтоимостиОбороты.Регистратор.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	РегистрНакопления.уатВыработкаПоСтоимости.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			Организация = &Организация
	|				И ТС В (&ТС)
	|				И ОбъектСтроительства В (&ОбъектСтроительства)
	|				И (&КонтрагентНеЗаполнен
	|					ИЛИ Контрагент = &Контрагент)
	|				И (ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
	|					ИЛИ ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяСпециальнойРаботы))) КАК уатВыработкаПоСтоимостиОбороты
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(ТС),
	|	СУММА(КоличествоОборот),
	|	СУММА(СуммаОборот),
	|	СУММА(СуммаНДСОборот)
	|ПО
	|	ОбъектСтроительства,
	|	Контрагент,
	|	ТС,
	|	Регистратор,
	|	НоменклатураУслуги";
	
	Запрос.УстановитьПараметр("ДатаНач", Объект.ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", Объект.ДатаКон);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ТС", мМассивТС);
	Запрос.УстановитьПараметр("ОбъектСтроительства", мМассивОбъектовСтроительства);
	Запрос.УстановитьПараметр("КонтрагентНеЗаполнен",  ?(ЗначениеЗаполнено(Объект.Контрагент), Ложь, Истина));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	ВыборкаЗапроса = Запрос.Выполнить();
	
	ТабДок = уатЗащищенныеФункцииСервер_проф.уатПечать_ЭСМ7_за_период(ВыборкаЗапроса, Объект.ДатаНач, Объект.ДатаКон, Объект.ДатаВыписки);
	//ТабДок = уатПечать_ЭСМ7_за_период(ВыборкаЗапроса, ДатаНач, ДатаКон, ДатаВыписки);
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.Защита = Истина;
	Табдок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ 

&НаКлиенте
Процедура НастройкаПериода(Команда)
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = Объект.ДатаНач;
	ДиалогПериода.Период.ДатаОкончания = Объект.ДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект, Новый Структура("ДиалогПериода", ДиалогПериода)));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат <> Неопределено Тогда
        Объект.ДатаНач = Результат.ДатаНачала;
        Объект.ДатаКон = Результат.ДатаОкончания;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	мсвТС = Новый Массив;
	мсвОбъектыСтроительства = Новый Массив;
	Если Объект.РежимОтбора = 0 Тогда
		Если ЗначениеЗаполнено(Объект.ТС) Тогда
			мсвТС.Добавить(Объект.ТС);
		КонецЕсли;
		Для Каждого ТекОбъект Из СписокОбъектыСтроительства Цикл
			Если ТекОбъект.Пометка Тогда
				мсвОбъектыСтроительства.Добавить(ТекОбъект.Значение);
			КонецЕсли;
		КонецЦикла;
	Иначе 
		Если ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
			мсвОбъектыСтроительства.Добавить(Объект.ОбъектСтроительства);
		КонецЕсли;
		Для Каждого ТекОбъект Из СписокТС Цикл
			Если ТекОбъект.Пометка Тогда
				мсвТС.Добавить(ТекОбъект.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ТекстОшибки = "Невозможно выполнить операцию:";
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо заполнить организацию.";
	Иначе
		Если НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация, "УчетВыработкиПоОбъектамСтроительства") Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - по организации """ + Объект.Организация + """ не ведётся учет выработки по объектам строительства.";
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаВыписки) Тогда
		ЕстьОшибки = Истина;
		ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо заполнить дату выписки.";
	КонецЕсли;
	
	Если Объект.РежимОтбора = 0 Тогда
		Если мсвТС.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо заполнить ТС.";
		КонецЕсли;	
		Если мсвОбъектыСтроительства.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо выбрать хотя бы один объект строительства.";
		КонецЕсли;
	Иначе
		Если мсвОбъектыСтроительства.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо заполнить объект строительства.";
		КонецЕсли;	
		Если мсвТС.Количество() = 0 Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = ТекстОшибки + Символы.ПС + " - необходимо выбрать хотя бы одно ТС.";
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ТабДок = СформироватьЭСМЗаПериод(мсвОбъектыСтроительства, мсвТС);
	ТабДок.Показать("ЭСМ-7");
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ТС, "уатОрганизация") <> Объект.Организация Тогда
		Объект.ТС = Неопределено;
	КонецЕсли;
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
	Если Объект.РежимОтбора = 0 Тогда
		Объект.ОбъектСтроительства = Неопределено;
		СписокТС.Очистить();
	Иначе
		Объект.ТС = Неопределено;
		СписокОбъектыСтроительства.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ТС) И НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ТС, "Организация");
	КонецЕсли;
	
	Если Объект.РежимОтбора = 0 Тогда
		ЗаполнитьОбъектыСтроительства();
	Иначе
		ЗаполнитьСписТС();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатИнтерфейсВводаТС.НомерТСНачалоВыбора(Элемент, Объект.ТС, Новый Структура("уатОрганизация", Объект.Организация), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	ЗаполнитьСписТС();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;
	Если Объект.ДатаНач = '00010101' Тогда
		Объект.ДатаНач = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если Объект.ДатаКон = '00010101' Тогда
		Объект.ДатаКон = ТекущаяДата();
	КонецЕсли;
	Объект.ДатаВыписки = ТекущаяДата();
	
	УстановитьВидимостьДоступность();
КонецПроцедуры
